Documents/ЗаказМатериаловВПроизводство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>ЗаказМатериаловВПроизводство</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОтгружатьЧастями</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПотреблениеДляДеятельности</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеховаяКладовая</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовМатериаловВПроизводство</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДлительностьПеремещения</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЖелаемаяДатаОтгрузки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтгрузки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЖелаемаяДатаПоступления</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьПеремещения</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГИГ_СхемаОбеспечения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СхемыОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГИГ_СрокПоставки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отменено</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтроки</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантОбеспечения</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкончаниеПоступления</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоОтгрузки</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаПродукции</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыАналитическогоУчетаНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗаказМатериаловВПроизводство/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Функция ГИГ_ЗаполнитьОбеспечениеВУстановленномПорядке(ВыбранноеЗначение)
		
	ПараметрыЗаполнения = Новый Структура("ПереченьВариантов, ИзменятьОбособление, ЗаполнятьЦелымиУпаковками", Неопределено, Истина, Ложь);
	ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ВыбранноеЗначение);
	
	ПутиКДанным = Новый Соответствие; //Описание особенностей формы
	ПутиКДанным.Вставить("ДатаОтгрузкиРабот", "НачалоОтгрузки");
	ПутиКДанным.Вставить("ДатаОтгрузки", "НачалоОтгрузки");
	
	ПараметрыДокумента = Новый Структура;
	ПараметрыДокумента.Вставить("МенеджерРегистра", РегистрыНакопления.ЗаказыМатериаловВПроизводство);
	ПараметрыДокумента.Вставить("ПутиКДанным", ПутиКДанным);
	
	//{Гига suv 11.01.2018
	//Свернуть
	
	СтруктураОтбор = Новый Структура("Номенклатура,Характеристика,Упаковка,Серия");
	СтруктураСуммирование = Новый Структура("КоличествоУпаковок,Количество");
	СтрокиВыбранные = Новый Массив;
	
	СоответствиеСтрок = Объект.Товары.Выгрузить(,"ИсходныйНомерСтроки,Номенклатура,Характеристика,Упаковка,Серия");
	
	СоответствиеСтрок.Очистить();
	
	Если Элементы.Товары.ВыделенныеСтроки.Количество() > 1 Тогда
		Для Каждого ИдентификаторСтроки из Элементы.Товары.ВыделенныеСтроки Цикл
			
			Строка = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
			
			ЗаполнитьЗначенияСвойств(СтруктураОтбор, Строка);
			
			Стр = СоответствиеСтрок.НайтиСтроки(СтруктураОтбор);
			
			Если НЕ Стр.Количество() Тогда
				Нстр = СоответствиеСтрок.Добавить();
				ЗаполнитьЗначенияСвойств(Нстр, Строка);
				Нстр.ИсходныйНомерСтроки = ИдентификаторСтроки;
				СтрокиВыбранные.Добавить(ИдентификаторСтроки);
			Иначе
				ЗаполнитьЗначенияСвойств(СтруктураСуммирование, Строка);
				
				СтрокаПриемник = Объект.Товары.НайтиПоИдентификатору(Стр[0].ИсходныйНомерСтроки);
				
				Для Каждого Колонка из СтруктураСуммирование Цикл
					СтрокаПриемник[Колонка.Ключ] = СтрокаПриемник[Колонка.Ключ] + Колонка.Значение;
				КонецЦикла;
				
				Объект.Товары.Удалить(Строка);
			КонецЕсли;	
			
		КонецЦикла;
	Иначе
		СтрокиВыбранные = Элементы.Товары.ВыделенныеСтроки;
	КонецЕсли;
	//Гига suv 11.01.2018}
	
	Таблица = ОбеспечениеСервер.ТаблицаЗаполнениеОбеспечения(
		СтрокиВыбранные,//Элементы.Товары.ВыделенныеСтроки,
		Объект,
		Объект.Товары,
		ПараметрыЗаполнения,
		ПараметрыДокумента);
	
	Если ТипЗнч(Таблица) <> Тип("ТаблицаЗначений") Тогда
		Возврат Новый Структура(
			"Ошибки",
			ОбеспечениеКлиентСервер.ОшибкиКонтроляОтгрузкиИОбеспечения(
				Таблица, "Товары", НСтр("ru = 'Товары'")));
	КонецЕсли;
	
	//{Гига suv 11.01.2018
	СтрокиТовары = Объект.Товары.Выгрузить(Новый Массив,"Номенклатура, Характеристика, ИсходныйНомерСтроки");
	//СтрокиТовары = Параметры.СтрокиТовары;
	//СтрокиТовары.Очистить();
	
	Для Каждого Индекс из СтрокиВыбранные Цикл
		СтрТовара = СтрокиТовары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрТовара,Объект.Товары.НайтиПоИдентификатору(Индекс));
		СтрТовара.ИсходныйНомерСтроки = Индекс;
	КонецЦикла;
	
	СтруктураПараметры = Новый Структура("Склад,СтрокиТовары,Дата",Объект.Склад,СтрокиТовары,Объект.Дата);
	ГИГ_ОбеспечениеСервер.ДополнитьОбеспечение(Таблица, СтруктураПараметры);
	//Гига suv 11.01.2018}
	
	//Перенос результатов в документ.
	ТекстОповещения = Документы.ЗаказМатериаловВПроизводство.ЗаполнитьВариантОбеспечения(
		Объект, ЭтаФорма, "СтрокиТовары", Таблица, ПараметрыУказанияСерий);
	
	Возврат Новый Структура("Ошибки, Оповещение", Неопределено, ТекстОповещения);
КонецФункции

&НаСервере
&Вместо("ЗаполнитьОбеспечениеВУстановленномПорядке")
Функция Рин1_ЗаполнитьОбеспечениеВУстановленномПорядке(ВыбранноеЗначение)
	
	Возврат ГИГ_ЗаполнитьОбеспечениеВУстановленномПорядке(ВыбранноеЗначение);
	
	Результат = ПродолжитьВызов(ВыбранноеЗначение);
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ГИГ_ОбработкаВыбораПеред(ВыбранноеЗначение, ИсточникВыбора)
//{Гига suv 12.02.2018 СхемыОбеспеченияДляЗаказов	
	Если ИсточникВыбора.ИмяФормы = "Обработка.ГИГ_ПодборТоваровВДокументПродажи.Форма.Форма" Тогда
		ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение);
	КонецЕсли;
//Гига suv 12.02.2018}	
КонецПроцедуры

&НаКлиенте
Процедура ГИГ_ПодобратьТоварыВместо(Команда)
	
	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина,
		"Документ.ЗаказМатериаловВПроизводство.ФормаДокумента.Команда.ПодобратьТовары");
	
	Отказ = Ложь;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Склад",                                     Объект.Склад);
	ПараметрыФормы.Вставить("РежимПодбораБезСуммовыхПараметров",         Истина);
	ПараметрыФормы.Вставить("ОтборПоТипуНоменклатуры",                   Новый ФиксированныйМассив(НоменклатураКлиентСервер.ОтборПоТоваруМногооборотнойТаре(Ложь)));
	ПараметрыФормы.Вставить("ИспользоватьДатыОтгрузки",                  Истина);
	ПараметрыФормы.Вставить("СкрыватьКолонкуВидЦены",                    Истина);
	ПараметрыФормы.Вставить("СкрыватьКомандуЦеныНоменклатуры",           Истина);
	ПараметрыФормы.Вставить("Заголовок",                                 НСтр("ru = 'Подбор товаров'"));
	ПараметрыФормы.Вставить("Дата",                                      Объект.Дата);
	ПараметрыФормы.Вставить("Документ",                                  Объект.Ссылка);
	ПараметрыФормы.Вставить("ПараметрыУказанияСерий",                    ПараметрыУказанияСерий);
	ПараметрыФормы.Вставить("Назначение",                                Объект.Назначение);
	ПараметрыФормы.Вставить("Подразделение",                             Объект.Подразделение);
	ПараметрыФормы.Вставить("ПодборВариантовОбеспечения",                Истина);
	//{Гига suv 12.01.2018
	//ОткрытьФорму("Обработка.ПодборТоваровВДокументПродажи.Форма", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
	ПараметрыФормы.Вставить("СкрыватьРучныеСкидки",                      Истина);
	ОткрытьФорму("Обработка.ГИГ_ПодборТоваровВДокументПродажи.Форма", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
	//Гига suv 12.01.2018}
	
КонецПроцедуры

&НаКлиенте
Процедура ГИГ_ТоварыГИГ_СхемаОбеспеченияНачалоВыбораВместо(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ОтборСклад = Объект.Склад;
	ОтборНоменклатура= Элемент.Родитель.ТекущиеДанные.Номенклатура;
	ОтборХарактеристикаНоменклатуры= Элемент.Родитель.ТекущиеДанные.Характеристика;
	
	ОткрытьФорму("Справочник.СхемыОбеспечения.Форма.ГИГ_ВыборСхемыПоСкладу",
				 Новый Структура("Склад,Номенклатура,Характеристика", ОтборСклад,ОтборНоменклатура,ОтборХарактеристикаНоменклатуры),
				 Элементы.ТоварыГИГ_СхемаОбеспечения
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ГИГ_ТоварыГИГ_СхемаОбеспеченияОбработкаВыбораПеред(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ДатаРасчета = ?(НЕ ЗначениеЗаполнено(Объект.Дата),ТекущаяДата(),Объект.Дата);
	
	ДанныеНоменклатуры = Новый Структура("Номенклатура,Характеристика");
	ЗаполнитьЗначенияСвойств(ДанныеНоменклатуры,Элемент.Родитель.ТекущиеДанные);
	
	СтруктураСроки = ГИГ_МодульВызовСервера.ГИГ_ПолучитьСрокиОбеспеченияПоСхеме(ВыбранноеЗначение,ДатаРасчета,Объект.Склад,ДанныеНоменклатуры);
		
	ЗаполнитьЗначенияСвойств(Объект.Товары.НайтиПоИдентификатору(Элемент.Родитель.ТекущаяСтрока),СтруктураСроки);

КонецПроцедуры

&НаКлиенте
Процедура Рин1_ОбработкаВыбораПеред(ВыбранноеЗначение, ИсточникВыбора)
	
	ГИГ_ОбработкаВыбораПеред(ВыбранноеЗначение, ИсточникВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура Рин1_ПодобратьТоварыПеред(Команда)
	
	ГИГ_ПодобратьТоварыВместо(Команда);
	Возврат;
	
КонецПроцедуры
